meeting/agenda/2023/09-05.org
:PROPERTIES:
:ID:       4A75EA71-D4A1-4597-981E-87634D8CFAB4
:END:
#+title: QT4 CG Meeting 044 Agenda 2023-09-05
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2023/07-25.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for
05 September,
the following meeting is scheduled for
12 September.

Any regrets for the following meeting?

** Review of open action items [0/5]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”
  + This is related to PR #368: Issue 129 - Context item generalized to context value and
    subsequent discussion.
+ [ ] QT4CG-029-07: NW to open the next discussion of #397 with a demo from DN
  See PR [[https://qt4cg.org/dashboard/#pr-449][#449]]
+ [ ] QT4CG-039-01: NW to schedule discussion of issue [[https://github.com/qt4cg/qtspecs/issues/52][#52]], /Allow record(*) based RecordTests/
+ [ ] QT4CG-042-01: NW to use sequences instead of arrays in ~parse-uri~ output.
+ [ ] QT4CG-042-02: NW to make the query into a simple map with repeated values.
+ [ ] QT4CG-042-03: NW to consider revisions to query parses.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

See technical agenda below.

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

Following our vacation, the chairs propose that we begin by triaging the open
PRs and issues. The chairs hope to time-box this to about 40 minutes
so that there’s time at the end of the call to discuss future planning
more broadly.

** Review of open PRs
:PROPERTIES:
:CUSTOM_ID: open-prs
:END:

1. Are they editorial, can we merge them without discussion?
   + Do they have merge conflicts that need to be resolved?
2. Are they substantive, complete, and ready for discussion?
3. Are they substantive but incomplete?

Open PRs as of Monday:

+ PR [[https://github.com/qt4cg/qtspecs/pull/664][#664]]: 663 xsl:original keywords
+ PR [[https://github.com/qt4cg/qtspecs/pull/659][#659]]: 647: schema location hints
+ PR [[https://github.com/qt4cg/qtspecs/pull/650][#650]]: 649: fix an xsl:fallback problem
+ PR [[https://github.com/qt4cg/qtspecs/pull/640][#640]]: 601: fn:all → fn:every?
+ PR [[https://github.com/qt4cg/qtspecs/pull/635][#635]]: 451: Schema compatibility
+ PR [[https://github.com/qt4cg/qtspecs/pull/633][#633]]: Edits ch. 4.1 through 4.15
+ PR [[https://github.com/qt4cg/qtspecs/pull/631][#631]]: 600: fn:decode-from-uri
+ PR [[https://github.com/qt4cg/qtspecs/pull/623][#623]]: 93: sort descending
+ PR [[https://github.com/qt4cg/qtspecs/pull/619][#619]]: XDM ch. 6 minor edits
+ PR [[https://github.com/qt4cg/qtspecs/pull/599][#599]]: 90: Simplified stylesheets with no xsl:version
+ PR [[https://github.com/qt4cg/qtspecs/pull/538][#538]]: Attempt to allow xs:string to be 'promoted to' xs:anyURI
+ PR [[https://github.com/qt4cg/qtspecs/pull/529][#529]]: 528: revision of json(), and renaming to xdm-to-json()
+ PR [[https://github.com/qt4cg/qtspecs/pull/470][#470]]: 369 add fixed-prefixes attribute in XSLT
+ PR [[https://github.com/qt4cg/qtspecs/pull/412][#412]]: 409, QT4CG-027-01: xsl:next-match
+ PR [[https://github.com/qt4cg/qtspecs/pull/368][#368]]: 129: Context item generalized to context value

** Review of open issues
:PROPERTIES:
:CUSTOM_ID: open-issues
:END:

Taking a “strike while the iron is hot” approach, are there any issues
currently being actively discussed in email or comments that would
benefit from meeting time?

** Broader planning
:PROPERTIES:
:CUSTOM_ID: h-0B1B9158-0899-4539-974A-F56EEAF3C85C
:END:

We’ve been working for about a year (44 meetings in just one day shy
of a calendar year). Do we continue as we have been, or is it time to
begin to attempt to exert pressure to draw things to a close?

Working groups can continue indefinitely, but the community isn’t well
served by specifications that are never delivered. At some point, the
group has to decide that it’s time to draw a boundary around the work
that’s proposed and accept that some items currently being considered
will have to be deferred until the next version.

Are we aiming to publish 4.0 in 2025 or 2030 or 2035?

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
