meeting/agenda/2023/09-05.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 044 Agenda 2023-09-05</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 044 Agenda 2023-09-05</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2023/07-25.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for
05 September,
the following meeting is scheduled for
12 September.
</p>

<p>
Any regrets for the following meeting?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/5]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”
<ul class="org-ul">
<li>This is related to PR #368: Issue 129 - Context item generalized to context value and
subsequent discussion.</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-029-07: NW to open the next discussion of #397 with a demo from DN
See PR <a href="https://qt4cg.org/dashboard/#pr-449">#449</a></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-039-01: NW to schedule discussion of issue <a href="https://github.com/qt4cg/qtspecs/issues/52">#52</a>, <i>Allow record(*) based RecordTests</i></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-042-01: NW to use sequences instead of arrays in <code>parse-uri</code> output.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-042-02: NW to make the query into a simple map with repeated values.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-042-03: NW to consider revisions to query parses.</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
See technical agenda below.
</p>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
Following our vacation, the chairs propose that we begin by triaging the open
PRs and issues. The chairs hope to time-box this to about 40 minutes
so that there’s time at the end of the call to discuss future planning
more broadly.
</p>
</div>

<div id="outline-container-open-prs" class="outline-3">
<h3 id="open-prs"><span class="section-number-3">2.1.</span> Review of open PRs</h3>
<div class="outline-text-3" id="text-open-prs">
<ol class="org-ol">
<li>Are they editorial, can we merge them without discussion?
<ul class="org-ul">
<li>Do they have merge conflicts that need to be resolved?</li>
</ul></li>
<li>Are they substantive, complete, and ready for discussion?</li>
<li>Are they substantive but incomplete?</li>
</ol>

<p>
Open PRs as of Monday:
</p>

<ul class="org-ul">
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/664">#664</a>: 663 xsl:original keywords</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/659">#659</a>: 647: schema location hints</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/650">#650</a>: 649: fix an xsl:fallback problem</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/640">#640</a>: 601: fn:all → fn:every?</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/635">#635</a>: 451: Schema compatibility</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/633">#633</a>: Edits ch. 4.1 through 4.15</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/631">#631</a>: 600: fn:decode-from-uri</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/623">#623</a>: 93: sort descending</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/619">#619</a>: XDM ch. 6 minor edits</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/599">#599</a>: 90: Simplified stylesheets with no xsl:version</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/538">#538</a>: Attempt to allow xs:string to be 'promoted to' xs:anyURI</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/529">#529</a>: 528: revision of json(), and renaming to xdm-to-json()</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/470">#470</a>: 369 add fixed-prefixes attribute in XSLT</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/412">#412</a>: 409, QT4CG-027-01: xsl:next-match</li>
<li>PR <a href="https://github.com/qt4cg/qtspecs/pull/368">#368</a>: 129: Context item generalized to context value</li>
</ul>
</div>
</div>

<div id="outline-container-open-issues" class="outline-3">
<h3 id="open-issues"><span class="section-number-3">2.2.</span> Review of open issues</h3>
<div class="outline-text-3" id="text-open-issues">
<p>
Taking a “strike while the iron is hot” approach, are there any issues
currently being actively discussed in email or comments that would
benefit from meeting time?
</p>
</div>
</div>

<div id="outline-container-h-0B1B9158-0899-4539-974A-F56EEAF3C85C" class="outline-3">
<h3 id="h-0B1B9158-0899-4539-974A-F56EEAF3C85C"><span class="section-number-3">2.3.</span> Broader planning</h3>
<div class="outline-text-3" id="text-h-0B1B9158-0899-4539-974A-F56EEAF3C85C">
<p>
We’ve been working for about a year (44 meetings in just one day shy
of a calendar year). Do we continue as we have been, or is it time to
begin to attempt to exert pressure to draw things to a close?
</p>

<p>
Working groups can continue indefinitely, but the community isn’t well
served by specifications that are never delivered. At some point, the
group has to decide that it’s time to draw a boundary around the work
that’s proposed and accept that some items currently being considered
will have to be deferred until the next version.
</p>

<p>
Are we aiming to publish 4.0 in 2025 or 2030 or 2035?
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>